app/controllers/dogs_controller.rb

  def create
    @dog = Dog.new(dog_params)
    @dog = current_user.dogs.build(dog_params)

    respond_to do |format|
      if @dog.save
---
INSERT INTO "dogs" ("name", "sex", "breed_of_dog", "birthday", "description", "created_at", "updated_at", "user_id", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @dog.update(dog_params)
---
UPDATE "dogs" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "dogs"."id" = ?  [["image_file_name", "image.jpg"], ["image_file_size", 193887], ["image_updated_at", "2018-06-27 07:17:38.833244"], ["updated_at", "2018-06-27 07:17:39.069001"], ["id", 13]]

  def destroy
    @dog.destroy
---
DELETE FROM "dogs" WHERE "dogs"."id" = ?  [["id", 4]]

    def set_dog
      @dog = Dog.find(params[:id])
---
SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def correct_user
    @dog = current_user.dogs.find_by(id: params[:id])
---
SELECT  "dogs".* FROM "dogs" WHERE "dogs"."user_id" = ? AND "dogs"."id" = ? LIMIT ?  [["user_id", 4], ["id", 3], ["LIMIT", 1]]